<PAD>
烦
祁
涮
转
均
匠
誤
透
寄
绿
判
针
拆
相
梦
咕
军
卉
圃
宽
邹
宏
尺
烁
赂
槍
倍
亨
月
轴
哲
璀
矩
自
多
卡
碑
响
浦
浴
蕾
隔
約
態
/
A
煤
供
杜
韦
奄
杉
璞
種
裤
嘲
却
益
拱
铭
按
尴
…
似
咪
钉
网
敌
糊
就
分
創
议
滑
淘
摊
联
懂
聊
侦
娇
囹
狭
脚
非
瓢
心
结
继
龍
祷
3
撑
澡
1
油
茜
贫
慷
桐
谣
验
怀
邕
嗦
原
粪
孔
献
忱
崇
座
岖
集
倡
申
如
纲
瑰
轿
朴
槽
拣
隊
統
嘉
敷
氏
山
酒
溯
蝠
洗
S
颈
蜂
峻
篮
厘
托
易
泣
蒂
诗
》
掏
晋
崛
波
黎
肃
覃
狩
卦
居
×
坎
偏
听
傀
萧
脆
決
名
克
、
義
播
轰
•
溅
業
沒
琢
树
察
舵
邓
切
痪
狐
個
诋
庙
懲
設
顯
揉
或
骨
泪
饱
妮
储
視
解
动
处
证
彻
负
肿
扔
’
疯
搜
析
瑞
圈
粉
宛
北
拟
髁
形
绰
把
變
态
但
炉
嗨
科
虑
敏
数
劍
含
吼
-
屑
·
铃
靠
险
膀
旬
聚
佑
鹰
叫
步
两
媒
秃
瞎
逗
沉
黯
淞
芝
岛
何
图
敲
妄
災
堵
岸
煎
們
设
情
杰
睡
峪
艳
涩
阑
全
隽
仲
举
赎
瀛
穿
洲
廖
册
浆
骑
毁
宜
復
瀚
鲨
沮
母
铜
沸
為
城
傅
据
淀
穴
辆
殆
伤
达
階
疫
艰
看
锁
耳
贩
圄
啃
尚
稀
岚
擦
蓉
孙
植
递
义
绵
被
莺
雨
菲
穩
贡
岑
毓
遵
语
哮
喊
碚
閱
渔
弥
竣
扭
晤
斗
橘
意
刑
吊
上
墅
罰
樂
趋
逮
七
胞
笼
驚
壤
醺
勤
红
亚
沪
惋
咖
卸
堪
辉
姓
浅
咋
訓
弃
八
雪
凭
搀
冠
惧
瑕
遮
垄
嚏
瞩
沫
罡
丸
着
柒
杖
炒
观
乳
呈
暄
信
享
洞
剧
署
祉
掌
匹
毋
褥
淇
弄
跟
围
距
涌
余
井
姻
首
燕
眨
擒
汾
激
群
弊
罗
载
东
坦
芯
栋
索
抗
工
价
媳
栖
马
氨
找
序
星
惯
姦
更
杆
苒
宫
炫
伦
历
伯
赖
债
洋
种
拦
地
杀
郊
泡
汝
辗
食
郸
願
较
珊
慧
祈
慕
蝙
途
抚
蛇
累
篷
范
盗
灿
鸡
震
苑
撼
讚
藍
终
闲
映
淡
剖
炽
诞
姜
悍
睦
央
滴
择
肖
啪
亏
备
户
齐
交
兼
厨
韶
恭
国
专
力
拭
免
洪
丙
垂
布
厥
é
咫
镌
難
痫
伸
旺
茶
恋
抨
虽
妻
募
焰
伍
积
診
世
脂
令
囤
缅
遇
予
筒
报
捎
逾
脱
荒
揣
体
歪
颁
參
纠
睛
璃
戶
泉
橄
枯
椒
旗
渗
屹
金
來
榄
宁
句
赚
彰
陆
紙
港
纪
扛
所
腥
叔
悴
灭
罔
障
嵘
攝
师
□
碎
匪
股
ö
本
派
缘
運
惡
样
帷
僵
晓
推
惶
付
晰
绳
姚
档
僧
耐
陶
苍
帽
番
谑
髅
发
牧
嗥
性
称
鲍
捞
戏
酸
况
郁
龊
嫁
墟
鐵
肪
拥
为
俭
装
崩
站
哺
妍
忆
萱
玺
谦
讳
广
俩
绪
款
識
給
婉
籍
氛
需
@
傲
鳄
腕
拖
药
瞪
侧
毒
伽
厦
河
魑
丑
習
循
讶
踏
蜚
镊
竭
渡
專
伊
凿
窝
劫
簽
滥
保
贯
窃
糕
冲
爬
您
址
湖
沃
讼
啡
幽
粥
褪
谅
臣
明
裹
抢
饶
斤
闽
夜
魁
四
凉
靳
垣
夸
姐
逛
职
琵
耿
赃
除
野
俱
泽
適
售
痕
與
州
强
贿
尔
癌
宝
衝
陷
哪
肌
羡
约
估
庆
[
凤
鬥
蕲
睢
尿
幅
摩
党
崖
定
耍
敦
吗
榆
削
寓
患
赔
级
溃
净
叙
延
稍
狮
姗
坏
措
比
当
妈
熏
晚
最
赤
答
检
浸
霾
得
绅
戛
驳
朋
能
磨
偿
搅
滿
半
腈
衛
赞
豆
初
眉
铮
饲
追
後
尬
苯
天
瓶
瞄
胫
啦
膊
客
盲
望
絮
逞
孪
垃
骋
驿
慰
挨
伏
舞
规
辩
普
嘿
嵬
漠
掀
林
殺
奏
谬
命
當
汰
場
巅
佩
蒋
摘
才
趁
皱
于
用
扑
逆
褚
颌
诛
末
彬
惺
梨
窘
！
歹
走
龙
贼
蔚
飙
娟
骼
靖
見
搽
咱
率
懵
柔
儡
镖
堂
笑
屉
咬
罚
控
此
鲁
兆
斟
黑
跳
捣
皂
觉
泛
纳
另
俨
奖
创
垒
众
搞
声
茁
抹
辟
馬
兩
酱
,
邯
题
僻
担
韧
概
背
落
亵
烈
瘫
品
施
每
健
狼
度
辖
砾
挟
嘴
件
代
別
祠
—
瞧
胆
忘
瑟
猛
椎
悦
遏
輕
钓
軍
粘
停
逝
致
倦
胸
窍
腩
孕
呆
草
侄
刹
苟
学
矛
奋
瘸
刚
洽
儀
－
訊
啸
凸
蹿
奶
阔
觅
肝
喀
劃
】
堆
衷
狱
摧
練
玮
塑
练
淮
偶
咨
溜
昏
锹
尝
抬
饰
枪
羹
芒
秧
怎
顶
执
浙
買
妖
憬
著
娜
E
慑
太
威
圖
氯
尘
晃
鲈
預
唐
糙
尼
躬
犬
拾
挪
尋
扯
肺
重
者
亥
霸
女
溫
挂
摸
消
榻
熱
拒
悼
仔
勝
府
這
错
欠
受
玷
冷
雾
遊
也
汶
字
契
幻
剐
沦
且
模
穆
巧
剪
戮
+
條
掐
酮
腦
粗
赵
靴
涕
怜
颇
荏
建
火
坞
虐
续
伟
权
喂
搭
功
眠
徐
橋
連
单
钿
廉
授
厂
译
靜
嚎
爸
旌
臭
蓋
讓
拓
横
摔
傻
頭
轲
员
狡
汪
好
街
纵
爱
罕
腰
哦
双
竹
坠
棒
蟒
互
？
乘
啕
坛
黄
绕
缜
犒
薇
莎
程
姣
峒
賽
零
绎
鸣
婿
犹
砍
薄
圾
踝
芬
惹
晒
迄
朽
潰
商
惑
经
佣
挚
目
吸
慮
甩
依
筐
述
谜
杭
蘭
吃
康
甥
泥
踩
O
纱
口
談
杈
身
室
邪
肚
溪
Q
悉
幸
肉
牺
痊
院
圆
孝
碗
庇
元
藏
紀
材
汹
污
显
帘
曝
赢
塊
粤
昊
撬
辦
艾
稠
圳
牢
芳
酪
衣
锅
稼
池
撤
去
偷
研
润
贝
季
確
償
姑
戲
數
该
劳
島
衬
灵
裴
滕
些
增
恨
4
购
拌
猎
镑
問
吝
夢
颅
补
坐
0
淆
鳕
筹
苦
到
隆
奔
歇
合
桌
壓
台
妙
戚
器
財
置
掘
鲸
肾
媛
盟
汉
湘
珍
乃
卓
预
員
责
螺
宋
臉
邢
廷
窗
承
氮
調
竞
穷
吮
归
枣
秽
渭
文
差
媲
歉
谏
息
俊
弧
渠
碰
假
茸
淑
總
曼
泊
猩
湾
逼
趟
鸟
）
爭
．
幕
划
鹏
麦
粮
嵌
眾
挫
键
區
卑
栏
披
降
岳
端
尾
臀
挡
扼
磕
立
泳
帆
叹
菊
辞
道
志
现
腿
获
丈
丢
帐
厢
摆
导
遣
企
窥
某
梅
砖
戰
寿
昔
还
谩
茅
吧
坤
姆
報
悲
允
顽
佚
孤
胁
洁
辱
耗
斧
攥
殡
抄
径
豁
届
類
話
念
肴
s
ō
躺
滔
粹
赌
華
抖
舌
锈
愚
轩
症
救
钦
匆
泓
砰
一
支
村
潭
轧
栽
谓
存
读
迷
愧
的
呻
猬
驴
袋
殖
片
赶
暴
纹
送
蛮
崮
堰
妨
速
胡
坝
柬
過
篁
逐
觀
丹
茬
脉
充
锻
饽
皓
革
9
腺
勇
是
霖
莞
房
移
淋
周
扎
思
灯
虞
戴
稻
樣
传
幾
誉
彩
艘
收
钳
娅
茨
浏
辍
碌
負
须
煌
膝
遗
烂
興
扒
脖
妹
禾
嘶
简
阴
悸
減
锂
袁
锐
入
郡
膜
旭
熟
爹
悔
恒
兵
嚣
庞
骤
靶
劈
蓥
熄
缩
焊
像
即
话
柯
边
皆
橙
達
5
套
躍
疏
嚷
棉
跃
近
證
蓄
石
娩
极
〈
催
玲
刘
U
缮
秒
计
撕
排
新
钎
侣
知
儒
進
魂
唯
驾
悟
婵
蹶
岗
呛
2
猴
毅
彭
廠
魏
韓
雅
厌
矶
静
缺
漩
奉
唬
璨
利
遍
　
别
调
函
射
澄
顿
稽
棕
帝
兹
抉
瓦
溺
闵
係
乎
茄
垢
測
评
视
足
复
熙
試
歷
蹋
拳
聲
丽
币
盆
邬
碟
贷
巫
節
在
鞍
胀
娶
梗
況
税
顾
黔
深
痒
岩
痍
械
昧
秋
搏
匿
詹
:
礼
墓
江
惕
陪
捍
手
败
界
醇
勺
■
肥
押
時
戈
启
们
暗
敗
贤
惜
机
苏
辽
贬
武
導
脊
忧
干
勋
镜
醒
钥
攀
贱
盈
之
括
次
聂
辰
钟
教
赁
詞
要
德
磊
墨
荐
衙
鸽
准
怖
衅
迅
外
旱
饪
前
王
欺
亡
照
尹
邦
尽
忏
慈
J
乙
澍
邻
涅
佐
揽
苛
促
楠
煳
慎
燃
秀
焦
案
殇
费
筑
右
杏
捷
域
境
裕
玄
尖
匀
咸
珠
修
际
矣
琴
满
穗
恩
绘
啊
吴
兒
频
伐
跑
避
掉
坯
處
誰
请
寞
羅
融
冽
舰
究
蚊
榴
浇
闪
罩
哨
肩
仪
霉
呵
劝
盔
刁
公
直
膏
寡
浑
英
從
澳
反
電
!
渝
退
寸
黨
触
爽
奮
赛
块
时
巨
采
戒
佛
挎
任
伺
莘
市
淌
酉
局
擇
赫
垫
味
滞
剑
络
娴
以
伙
弯
轻
郭
苹
丰
术
缈
醫
樱
獲
欣
徽
亿
涉
了
乱
說
斷
害
颂
儿
窜
屯
面
什
难
瘾
楼
将
疮
限
根
沧
夭
橱
橡
沟
育
飘
有
起
翩
聖
晦
柑
浓
确
鉴
势
埔
唇
笨
～
演
爷
础
影
翘
湛
骇
水
枫
曲
琪
拙
审
灾
記
瞬
睁
纬
仁
魅
琮
坚
镣
 
6
霍
吓
谈
蹂
溉
踢
先
洛
遥
翼
律
钮
書
鸦
職
蛛
困
柳
庸
素
具
踉
卧
诉
迟
棘
晨
繁
趴
海
寻
族
姿
包
账
莆
否
尉
屋
状
骗
家
臂
驶
洒
写
煽
倚
禱
若
氣
錄
辛
俞
揪
昆
姨
躯
回
謙
颠
向
侨
役
瘤
敢
和
凡
幫
闭
车
蔓
成
萌
ン
争
猾
贸
攒
打
○
冒
枝
網
危
琦
嫖
茗
璜
會
費
莲
對
舒
束
X
般
香
宣
己
住
毙
容
箭
審
佯
博
系
爪
认
滨
开
疾
坡
饥
玫
沈
川
田
急
细
寰
严
盒
發
肢
倾
榜
物
哄
狗
连
仙
他
哼
歌
欧
選
畢
晴
离
流
助
绛
不
行
晶
犊
方
黏
強
梁
枚
扶
俘
柴


来
化
哽
孩
憋
闻
总
炅
快
茂
龌
取
捐
誕
策
梧
砂
凳
斜
珀
棍
《
条
夕
跄
袭
哈
唱
毯
侯
腾
佳
鹦
领
镀
朗
沂
；
副
巾
娘
牛
冕
疵
冈
织
彼
产
渎
吟
搡
帜
梯
傳
残
路
悠
泰
荆
衔
斐
温
纽
无
钻
菜
。
辈
棚
侮
雷
愈
操
莽
豫
友
購
缓
評
邊
乏
馨
間
谊
稿
奠
國
拔
混
盜
锋
偻
恪
蔬
浪
棋
章
昂
弹
湿
紅
舍
峭
聪
扳
翁
编
诺
並
使
懒
繼
傍
曙
蛋
与
底
悬
仗
怨
肆
昌
辑
词
猜
谍
配
侠
俄
憧
躁
百
潜
架
冶
睹
麟
华
老
斩
頁
妇
阅
仆
堕
液
期
澜
潢
嚴
刊
印
實
吨
扮
由
扩
羊
愉
袖
言
產
热
陽
憾
讽
页
炭
询
振
價
妥
项
仕
良
尤
钱
剩
焕
变
竖
涛
讯
婷
酿
济
赏
薪
毫
塌
床
億
哭
事
咎
这
迁
厚
弟
钧
灌
芦
诡
K
万
t
牵
恼
浠
奈
拐
富
擅
叛
便
鬼
叠
訝
瘁
靡
徒
呢
抒
美
骂
瞒
禽
清
船
奸
夹
谨
碾
兑
大
翻
矿
歐
京
卫
級
嗜
勘
闫
寨
煞
失
板
督
死
複
仅
录
颗
腹
桦
迹
招
囊
虫
留
滩
折
 
揭
赴
該
真
微
拮
拄
铺
恰
店
奎
旦
尸
劣
癫
狂
婦
磺
对
Y
釋
稱
塢
訪
搐
湍
基
汤
破
骚
然
援
六
猥
賺
汽
奕
吞
疼
酋
逊
闯
疆
疤
夫
蝶
资
牌
漆
聯
从
棵
晕
弱
再
门
给
间
恶
琳
想
加
休
青
漳
―
擔
耀
校
防
(
將
飞
又
值
诫
蓬
彦
坑
忽
宗
飲
迎
南
兄
吆
撂
帳
鸭
扁
画
叨
蕴
線
驻
嗓
窒
胯
宇
桑
獎
怒
缥
谷
斑
徊
征
n
串
琶
愤
释
暧
虾
烟
扣
妓
官
漏
钩
蔽
附
拼
標
标
组
班
喻
囚
丁
胳
毀
盯
>
注
轮
彤
憔
郎
常
團
亦
宪
主
<
民
买
谐
龟
贵
轨
我
禺
*
”
银
跚
杯
淤
阳
俗
竟
营
幢
冻
腓
題
喘
填
撞
恳
枷
顺
诟
甸
襄
缠
陕
槟
踹
返
泼
人
锡
测
烤
耷
膛
柜
环
哀
赋
酗
坪
誓
瓯
摄
韩
废
纯
仍
捉
熬
云
脅
券
袍
醉
涯
拧
磁
日
略
替
书
召
萄
胜
腔
罪
锥
烹
挑
撒
始
冀
罐
忍
铁
扫
挖
独
袒
灘
敬
裝
禁
培
秩
场
光
昭
你
8
久
脑
灼
嘀
碍
屏
鲜
蓝
噪
聘
協
添
盘
峨
墩
内
参
凛
ḳ
吁
擊
蜷
业
悄
构
鹿
绌
津
桃
崎
枉
]
松
阜
绣
憨
九
勐
翰
诊
艇
持
厅
恢
胎
几
慌
缢
笛
惰
求
曹
肤
N
其
欢
滤
徘
旁
渴
隱
超
搁
雇
咐
而
脸
牙
中
脾
娃
嘛
冤
掺
紊
扰
啼
畏
阵
绝
逍
詳
騙
电
二
亭
張
运
符
祥
婆
沿
下
描
狠
战
?
层
缆
蹦
亩
勿
勒
挥
筋
帶
孟
饮
猪
麾
吐
嚓
诚
及
寒
硕
伴
巷
雕
麼
没
带
荼
卖
腐
作
柱
D
朝
待
冰
議
‘
寅
萝
践
讲
坟
趾
競
记
陋
突
帕
噩
秦
躏
豪
捻
顷
埋
忑
扇
盐
攘
吵
色
篇
炙
嬉
蹭
饼
割
喉
皇
舱
叉
染
卢
辨
插
养
泄
眈
聞
误
胖
L
郅
，
峡
擎
惩
额
肘
咧
–
盼
箱
唉
神
轉
古
财
藤
漫
盛
她
卻
侵
哒
链
象
绩
签
庄
迈
位
善
精
露
饭
斯
五
张
董
旨
姬
〉
杨
码
霞
蹈
办
夏
葛
錯
萬
因
坍
長
父
奢
裸
嫂
郜
柿
雯
蠢
朵
荷
诀
关
a
丧
蹬
啥
阿
放
史
殷
裆
貌
耶
剔
输
既
稳
必
减
队
b
蹲
曜
卷
花
壁
桓
牲
罢
險
删
少
哥
血
捧
社
桥
李
莫
管
丝
曾
玛
料
忠
廊
荀
堅
許
礙
炮
都
甘
齿
転
仰
巡
恤
遂
T
項
應
出
緊
质
园
贏
贾
进
陌
絡
算
引
今
谎
桩
熠
倒
峰
例
详
宴
冗
恐
狈
怕
阶
琐
训
违
捡
高
刀
岁
吉
硬
宮
毕
「
冉
衫
弓
福
痛
屠
攻
醛
.
抽
努
忙
宅
夯
纺
麓
恍
嫩
贺
捕
胃
尊
庭
ポ
酌
鄞
東
抱
（
表
逻
垮
见
说
潇
鱼
格
盖
勃
通
叶
寝
彪
狄
米
學
谋
故
汀
第
哆
效
共
剥
龄
决
疲
西
俪
钇
那
寺
制
它
瘀
嫌
猫
猷
喜
烫
炸
政
喱
指
涂
桶
摇
够
岔
親
禮
葩
丛
虚
亲
膺
袜
怪
卜
示
甄
塞
刨
阱
霜
瞰
团
嘱
活
佟
剂
宾
認
吕
焚
殃
舆
俯
怡
虎
守
驰
治
让
馒
玖
辜
兽
耽
翠
錢
瑶
各
風
關
兜
鞭
很
左
三
拽
凯
痴
術
类
浩
子
技
犀
睐
泻
細
优
咙
耕
窄
盾
兢
凌
補
榈
版
货
敛
荣
君
蛙
务
炼
缴
畿
滋
刮
病
療
完
午
癖
夠
峙
课
齡
览
沼
撇
內
惨
告
锦
%
拉
據
7
捂
童
暂
实
抑
塔
寫
爵
葡
随
铲
巴
惟
十
拢
协
亮
省
钙
萦
裡
邮
妆
士
雁
豹
侃
V
羞
漂
颐
跻
狀
往
冬
蛾
塘
旋
缝
機
屈
坷
森
木
厮
提
截
馈
翔
综
鼠
鸿
球
玩
蚀
捆
拯
斌
销
慢
椅
散
觥
論
掩
蹒
艺
贴
黃
菌
紧
陈
賭
潮
贪
澈
汗
仿
宙
疑
探
畅
亞
疹
胶
崔
銷
肋
際
虹
忐
【
藉
兴
适
角
鼎
凶
經
履
玻
愿
織
陡
缪
果
部
肇
拴
镇
希
奇
理
节
饿
甫
苗
軸
至
磋
可
灰
抓
：
圣
闸
岱
絕
骏
勾
蚕
肠
屁
;
師
头
伪
握
已
密
烧
棱
短
跌
席
琼
励
昼
登
查
點
荡
秘
厉
压
恕
平
還
抵
特
谴
畜
式
早
里
酷
固
榮
夺
氧
感
餐
绑
改
陛
腳
临
只
肯
鑫
潘
铐
型
硫
裔
祖
夥
動
麻
讀
兰
镰
哗
砸
乍
迭
殊
騎
低
份
孰
佝
统
批
凑
郝
旅
牟
损
绚
犯
远
伞
樓
号
丘
領
埃
浜
翅
覽
司
腱
缔
护
炜
侈
诧
纸
陵
挠
裁
库
猝
蝴
刻
扬
过
选
颖
莹
恿
閉
借
驱
淫
渐
柏
挣
雄
炎
异
髋
掷
"
歲
磅
萍
靈
韬
骄
永
默
诱
纷
弗
轶
乔
量
识
紫
安
杂
)
璐
渊
側
展
魔
游
拿
酬
續
谁
维
邀
腊
盹
滚
玉
甚
啻
止
唤
違
涨
弘
同
萊
闷
溧
乌
涡
羸
竊
馆
躲
赠
雖
炳
捅
娱
欲
应
鹤
舅
寂
“
儘
'
昨
瑜
厕
哑
绯
仓
沾
歆
婴
傷
仇
殴
製
庚
帮
逢
占
屡
祸
耻
衡
棠
诬
築
莉
蜜
／
迫
崴
娣
跨
祝
匙
怂
離
气
造
迪
訴
等
熊
暖
源
逸
菁
壶
霆
簿
襟
正
斥
汇
租
宠
匕
鞋
萨
遭
监
冯
则
换
園
赡
厄
鞠
烽
蔡
踪
辅
么
医
愛
侥
风
访
乡
凹
习
典
禧
饵
B
朱
皮
试
搂
禅
脏
甲
线
炖
懈
击
隐
慨
兔
男
嘘
呀
千
吩
法
秉
白
赣
覆
颜
拜
羽
钢
年
段
智
樊
宿
笔
挽
委
陀
仑
敵
后
缉
乐
候
惊
渣
投
挤
狸
眼
無
拨
铅
春
壮
升
阻
谢
未
浮
携
御
整
小
点
惫
骸
幼
體
许
郑
弈
忌
莱
&
讨
粒
骷
呼
咽
阎
楚
软
龚
并
钞
论
現
警
刷
潞
咒
诸
祭
沙
列
拘
計
梓
鼓
爆
会
航
甜
生
问
绍
乾
趣
个
凝
忿
诈
卵
搬
蒙
拍
蛲
極
汕
鐘
婚
舟
接
瓜
鄂
喝
糟
酣
订
封
吻
稚
車
纤
墙
堡
介
土
飚
帅
做
抛
殿
幌
坊
旧
吹
闹
挺
奥
°
毛
农
私
栓
岭
劲
音
芮
惠
骆
越
喷
颤
县
邵
空
	
於
断
羁
属
疗
核
葬
区
逃
矮
刺
跪
帖
考
淹
株
邱
燒
钗
開
組
景
莓
結
锤
辣
裂
服
隙
」
桂
衰
瘦
鼻
歧
票
长
